시리즈, 데이터프레임    
시리즈:1차원 배열과 같은 자료구조, 다양한 자료를 저장, index를 가지고 있음, 배열, 딕셔너리로 부터 생성

In [1]:
import pandas as pd

In [2]:
#from pandas import Series, DataFrame

In [3]:
import numpy as np
import matplotlib.pyplot as plt

In [8]:
obj=pd.Series([3,1,-5,2])
obj

0    3
1    1
2   -5
3    2
dtype: int64

In [9]:
obj.values

array([ 3,  1, -5,  2], dtype=int64)

In [10]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [11]:
#인덱스는 저장된 데이터의 이름(번호)
#인덱스는 행/열 인덱스가 있음
#인덱스를 이용하여 자료를 참조(loc, iloc)
#인덱스는 0번부터 부여

In [14]:
obj=pd.Series([3,1,-5,2], index=['d','a','b','c'])
obj
obj.index

Index(['d', 'a', 'b', 'c'], dtype='object')

In [17]:
obj['b']
obj['c']=9
obj

d    3
a    1
b   -5
c    9
dtype: int64

In [21]:
obj[['c','a','b']] #2개 이상의 행/열 인덱스 지정시 [[]] 사용

c    9
a    1
b   -5
dtype: int64

In [22]:
obj

d    3
a    1
b   -5
c    9
dtype: int64

In [27]:
obj[obj>0]
obj*2
np.exp(obj)

d      20.085537
a       2.718282
b       0.006738
c    8103.083928
dtype: float64

In [30]:
obj
'k' in obj
'a' in obj

True

In [31]:
sdata={'Seoul':1000, 'Incheon':200, 'Gwangju':100, 'Busan':300}

In [33]:
obj2=pd.Series(sdata) #Key -> index, Value -> Value
obj2

Seoul      1000
Incheon     200
Gwangju     100
Busan       300
dtype: int64

In [34]:
obj2['Gwangju']

100

In [35]:
cities=['Seoul', 'Incheon', 'Suwon', 'Daejon']

In [38]:
obj4=pd.Series(sdata, index=cities)

In [39]:
obj4

Seoul      1000.0
Incheon     200.0
Suwon         NaN
Daejon        NaN
dtype: float64

In [42]:
pd.isnull(obj4)
pd.notnull(obj4)
obj4.isnull()

Seoul      False
Incheon    False
Suwon       True
Daejon      True
dtype: bool

In [45]:
obj2

Seoul      1000
Incheon     200
Gwangju     100
Busan       300
dtype: int64

In [47]:
for k, v in obj2.items():
    print(k, v)

Seoul 1000
Incheon 200
Gwangju 100
Busan 300

In [48]:
obj2['Jeju']=50

In [49]:
obj2

Seoul      1000
Incheon     200
Gwangju     100
Busan       300
Jeju         50
dtype: int64

In [50]:
del obj2['Incheon']

In [41]:
# 1)열이 되는 1차원 데이터 배열 또는 리스트 작성
# 2) 열에 대한 이름을 키로 갖는 딕셔너리를 작성
# 3) 열방향 인덱스:columns, 행방향 인덱스:index

data = {
    "2015": [9904312, 3448737, 2890451, 2466052],
    "2010": [9631482, 3393191, 2632035, 2431774],
    "2005": [9762546, 3512547, 2517680, 2456016],
    "2000": [9853972, 3655437, 2466338, 2473990],
    "지역": ["수도권", "경상권", "수도권", "경상권"],
    "2010-2015 증가율": [0.0283, 0.0163, 0.0982, 0.0141]
}
#cols = ["지역", "2015", "2010", "2005", "2000", "2010-2015 증가율"]
idx = ["서울", "부산", "인천", "대구"]

In [42]:
#pd.Series(data)
#pd.DataFrame(data, index=idx, columns=cols)
df=pd.DataFrame(data, index=idx)
df

       2015     2010     2005     2000   지역  2010-2015 증가율
서울  9904312  9631482  9762546  9853972  수도권         0.0283
부산  3448737  3393191  3512547  3655437  경상권         0.0163
인천  2890451  2632035  2517680  2466338  수도권         0.0982
대구  2466052  2431774  2456016  2473990  경상권         0.0141

In [68]:
df.values

array([[9904312, 9631482, 9762546, 9853972, '수도권', 0.0283],
       [3448737, 3393191, 3512547, 3655437, '경상권', 0.0163],
       [2890451, 2632035, 2517680, 2466338, '수도권', 0.0982],
       [2466052, 2431774, 2456016, 2473990, '경상권', 0.0141]], dtype=object)

In [69]:
df.columns

Index(['2015', '2010', '2005', '2000', '지역', '2010-2015 증가율'], dtype='object')

In [70]:
df.index

Index(['서울', '부산', '인천', '대구'], dtype='object')

In [74]:
df.index.name="도시"
df.columns.name="특징"
df

특징     2015     2010     2005     2000   지역  2010-2015 증가율
도시
서울  9904312  9631482  9762546  9853972  수도권         0.0283
부산  3448737  3393191  3512547  3655437  경상권         0.0163
인천  2890451  2632035  2517680  2466338  수도권         0.0982
대구  2466052  2431774  2456016  2473990  경상권         0.0141

In [75]:
df.T

도시                  서울       부산       인천       대구
특징
2015           9904312  3448737  2890451  2466052
2010           9631482  3393191  2632035  2431774
2005           9762546  3512547  2517680  2456016
2000           9853972  3655437  2466338  2473990
지역                 수도권      경상권      수도권      경상권
2010-2015 증가율   0.0283   0.0163   0.0982   0.0141

In [81]:
df['2010-2015 증가율']=df['2010-2015 증가율']*100
df

특징     2015     2010     2005     2000   지역  2010-2015 증가율
도시
서울  9904312  9631482  9762546  9853972  수도권           2.83
부산  3448737  3393191  3512547  3655437  경상권           1.63
인천  2890451  2632035  2517680  2466338  수도권           9.82
대구  2466052  2431774  2456016  2473990  경상권           1.41

In [84]:
#'2005-2010 증가율' 컬럼 추가 = (2010-2005)/2005*100
#feature engineering(특성 공학)
df['2005-2010 증가율']= ((df['2010']-df['2005'])/df['2005']*100).round(2)
df

특징     2015     2010     2005     2000   지역  2010-2015 증가율  2005-2010 증가율
도시
서울  9904312  9631482  9762546  9853972  수도권           2.83          -1.34
부산  3448737  3393191  3512547  3655437  경상권           1.63          -3.40
인천  2890451  2632035  2517680  2466338  수도권           9.82           4.54
대구  2466052  2431774  2456016  2473990  경상권           1.41          -0.99

In [86]:
del df['2010-2015 증가율']

In [87]:
df

특징     2015     2010     2005     2000   지역  2005-2010 증가율
도시
서울  9904312  9631482  9762546  9853972  수도권          -1.34
부산  3448737  3393191  3512547  3655437  경상권          -3.40
인천  2890451  2632035  2517680  2466338  수도권           4.54
대구  2466052  2431774  2456016  2473990  경상권          -0.99

In [98]:
type(df['지역']) #시리즈
type(df)
type(df[['지역']])#데이터프레임

pandas.core.frame.DataFrame

In [95]:
type(df[['2010','2015']]) #데이터프레임

pandas.core.frame.DataFrame

In [99]:
df

특징     2015     2010     2005     2000   지역  2005-2010 증가율
도시
서울  9904312  9631482  9762546  9853972  수도권          -1.34
부산  3448737  3393191  3512547  3655437  경상권          -3.40
인천  2890451  2632035  2517680  2466338  수도권           4.54
대구  2466052  2431774  2456016  2473990  경상권          -0.99

In [104]:
df2=pd.DataFrame(np.arange(12).reshape(3,4)) #정수 인덱스
df2

   0  1   2   3
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [106]:
#열 단위 데이터 추출

df2[2] #열 인덱스 2번에 해당되는 자료가 시리즈 형태로 출력됨(행 인덱스는 0, 1, 2)
df2[[1,2]]

   1   2
0  1   2
1  5   6
2  9  10

In [109]:
df

특징     2015     2010     2005     2000   지역  2005-2010 증가율
도시
서울  9904312  9631482  9762546  9853972  수도권          -1.34
부산  3448737  3393191  3512547  3655437  경상권          -3.40
인천  2890451  2632035  2517680  2466338  수도권           4.54
대구  2466052  2431774  2456016  2473990  경상권          -0.99

In [108]:
#행 단위로 데이터 추출 -> 슬라이싱 [시작인덱스:끝인덱스-1]
#df[:1] #0번 행 인덱스 추출, 
df[1:2] #1번 행 인덱스~2-1번 행 인덱스 추출

특징     2015     2010     2005     2000   지역  2005-2010 증가율
도시
부산  3448737  3393191  3512547  3655437  경상권           -3.4

In [110]:
df[1:3]

특징     2015     2010     2005     2000   지역  2005-2010 증가율
도시
부산  3448737  3393191  3512547  3655437  경상권          -3.40
인천  2890451  2632035  2517680  2466338  수도권           4.54

In [111]:
df

특징     2015     2010     2005     2000   지역  2005-2010 증가율
도시
서울  9904312  9631482  9762546  9853972  수도권          -1.34
부산  3448737  3393191  3512547  3655437  경상권          -3.40
인천  2890451  2632035  2517680  2466338  수도권           4.54
대구  2466052  2431774  2456016  2473990  경상권          -0.99

In [116]:
df['서울':]
df['부산':'대구'] #부산~대구까지 모든 행 추출
df['부산':'인천']

특징     2015     2010     2005     2000   지역  2005-2010 증가율
도시
부산  3448737  3393191  3512547  3655437  경상권          -3.40
인천  2890451  2632035  2517680  2466338  수도권           4.54

In [117]:
#df에서 2000년도 인천 인구 추출(2466338)
df

특징     2015     2010     2005     2000   지역  2005-2010 증가율
도시
서울  9904312  9631482  9762546  9853972  수도권          -1.34
부산  3448737  3393191  3512547  3655437  경상권          -3.40
인천  2890451  2632035  2517680  2466338  수도권           4.54
대구  2466052  2431774  2456016  2473990  경상권          -0.99

In [120]:
df['2000']['인천']

2466338

In [121]:
%%writefile sample1.csv
c1, c2, c3
1, 1.11, one
2, 2.22, two
3, 3.33, three

Writing sample1.csv

In [122]:
pd.read_csv("sample1.csv")

   c1    c2      c3
0   1  1.11     one
1   2  2.22     two
2   3  3.33   three

In [123]:
%%writefile sample2.csv
1, 1.11, one
2, 2.22, two
3, 3.33, three

Writing sample2.csv

In [125]:
pd.read_csv("sample2.csv", names=['c','c2','c3']) #열 이름 설정

   c    c2      c3
0  1  1.11     one
1  2  2.22     two
2  3  3.33   three

In [126]:
pd.read_csv("sample1.csv")

   c1    c2      c3
0   1  1.11     one
1   2  2.22     two
2   3  3.33   three

In [128]:
#데이터프레임의 특정열을 행 인덱스로 사용하고자 한다면...
pd.read_csv("sample1.csv", index_col='c1')

      c2      c3
c1
1   1.11     one
2   2.22     two
3   3.33   three

In [129]:
%%writefile sample3.txt
c1        c2        c3        c4
0.179181 -1.538472  1.347553  0.43381
1.024209  0.087307 -1.281997  0.49265
0.417899 -2.002308  0.255245 -1.10515

Writing sample3.txt

In [131]:
#여러 개의 공백 문자로 구분
pd.read_table("sample3.txt", sep="\s+")

         c1        c2        c3       c4
0  0.179181 -1.538472  1.347553  0.43381
1  1.024209  0.087307 -1.281997  0.49265
2  0.417899 -2.002308  0.255245 -1.10515

In [132]:
%%writefile sample4.txt
파일 제목: sample4.txt
데이터 포맷의 설명:
c1, c2, c3
1, 1.11, one
2, 2.22, two
3, 3.33, three

Writing sample4.txt

In [135]:
pd.read_csv("sample4.txt",skiprows=[0,1]) #0번 1번 행 index에 해당되는 자료를 skip
#pd.read_csv("sample4.txt")

   c1    c2      c3
0   1  1.11     one
1   2  2.22     two
2   3  3.33   three

In [136]:
pd.read_csv("sample4.txt",skiprows=2) #2줄까지 무시됨

   c1    c2      c3
0   1  1.11     one
1   2  2.22     two
2   3  3.33   three

In [162]:
%%writefile sample5.csv
c1, c2, c3
1, 1.11, one
2,없음, two
누락, 3.33, three

Overwriting sample5.csv

In [163]:
df=pd.read_csv("sample5.csv", na_values=['누락','없음'])
df

    c1    c2      c3
0  1.0  1.11     one
1  2.0   NaN     two
2  NaN  3.33   three

In [164]:
#to_csv:데이터프레임을 csv로 저장
df.to_csv('sample6.csv')

In [165]:
!type sample6.csv # mac or linux  =>    !cat sample6.csv

,c1, c2, c3
0,1.0,1.11, one
1,2.0,, two
2,,3.33, three

In [166]:
df.to_csv('sample7.txt', sep="|")

In [167]:
!type sample7.txt

|c1| c2| c3
0|1.0|1.11| one
1|2.0|| two
2||3.33| three

In [172]:
df.to_csv('sample8.csv', na_rep='누락', encoding='euc-kr') # encoding='euc-kr'

In [173]:
!type sample8.csv

,c1, c2, c3
0,1.0,1.11, one
1,2.0,누락, two
2,누락,3.33, three

In [176]:
df.index=['a','b','c']
df

    c1    c2      c3
a  1.0  1.11     one
b  2.0   NaN     two
c  NaN  3.33   three

In [177]:
df.to_csv("sample9.csv")

In [179]:
df.to_csv("sample9.csv", index=False, header=False)

In [183]:
df=pd.read_csv("https://gist.github.com/michhar/2dfd2de0d4f8727f873422c5d959fff5/raw/fa71405126017e6a37bea592440b4bee94bf7b9e/titanic.csv")
df

df=pd.read_csv("https://github.com/CSSEGISandData/COVID-19/raw/master/csse_covid_19_data/csse_covid_19_time_series/time_series_covid19_confirmed_global.csv")
df

,Province/State,Country/Region,Lat,Long,1/22/20,1/23/20,1/24/20,1/25/20,1/26/20,1/27/20,...,3/14/21,3/15/21,3/16/21,3/17/21,3/18/21,3/19/21,3/20/21,3/21/21,3/22/21,3/23/21
0,NaN,Afghanistan,33.939110,67.709953,0,0,0,0,0,0,...,55985,55985,55995,56016,56044,56069,56093,56103,56153,56177
1,NaN,Albania,41.153300,20.168300,0,0,0,0,0,0,...,117474,118017,118492,118938,119528,120022,120541,121200,121544,121847
2,NaN,Algeria,28.033900,1.659600,0,0,0,0,0,0,...,115265,115410,115540,115688,115842,115970,116066,116157,116255,116349
3,NaN,Andorra,42.506300,1.521800,0,0,0,0,0,0,...,11266,11289,11319,11360,11393,11431,11481,11517,11545,11591
4,NaN,Angola,-11.202700,17.873900,0,0,0,0,0,0,...,21380,21407,21446,21489,21558,21642,21696,21733,21757,21774
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
269,NaN,Vietnam,14.058324,108.277199,0,2,2,2,2,2,...,2554,2557,2560,2567,2570,2571,2572,2572,2575,2575
270,NaN,West Bank and Gaza,31.952200,35.233200,0,0,0,0,0,0,...,209304,211602,213791,215984,218061,219912,221391,223638,225976,228044
271,NaN,Yemen,15.552727,48.516388,0,0,0,0,0,0,...,2836,2908,2969,3037,3126,3217,3278,3418,3516,3612
272,NaN,Zambia,-13.133897,27.849332,0,0,0,0,0,0,...,84797,84950,85240,85502,85889,86059,86273,86449,86535,86779
273,NaN,Zimbabwe,-19.015438,29.154857,0,0,0,0,0,0,...,36484,36504,36535,36552,36611,36652,36662,36665,36684,36717

In [184]:
df=pd.read_csv("gapminder.tsv", sep="\t")
df

          country continent  year  lifeExp       pop   gdpPercap
0     Afghanistan      Asia  1952   28.801   8425333  779.445314
1     Afghanistan      Asia  1957   30.332   9240934  820.853030
2     Afghanistan      Asia  1962   31.997  10267083  853.100710
3     Afghanistan      Asia  1967   34.020  11537966  836.197138
4     Afghanistan      Asia  1972   36.088  13079460  739.981106
...           ...       ...   ...      ...       ...         ...
1699     Zimbabwe    Africa  1987   62.351   9216418  706.157306
1700     Zimbabwe    Africa  1992   60.377  10704340  693.420786
1701     Zimbabwe    Africa  1997   46.809  11404948  792.449960
1702     Zimbabwe    Africa  2002   39.989  11926563  672.038623
1703     Zimbabwe    Africa  2007   43.487  12311143  469.709298

[1704 rows x 6 columns]

In [186]:
df=pd.read_csv("scientists.csv")
df

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

In [ ]:
# 1. gapminder.tsv파일을 읽고 다음 작업을 진행하시오  
# (read_csv를 사용하되, sep=\t로 설정하여 읽을 것)  

# -자료 크기, 차원, 컬럼, 타입 등 읽어들인 자료의 구조를 확인하시오  
# -국가명, 대륙명, 연도 열을 추출하시오  
# -lifeExp(기대수명),pop(인구),gdp(소득)의 최대/최소/평균/표준편차  

data=pd.read_csv("C:/Users/19178/TIL/jupyter/pandas_data/gapminder.tsv",sep='\t')
print(data.shape)
print(data.index)
print(data.columns)
print(type(data))

data.sample(5)

data.loc[:,'country':'year']
data.loc[:,['country','continent','year']]
data[['country','continent','year']]
data.iloc[:,[0,1,2]]
data.iloc[:,0:3]

def summary_stat(x):
    x_min=x.min()
    x_max=x.max()
    x_mean=x.mean()
    x_sd=((data.lifeExp-data.lifeExp.mean())**2).mean()
    return x_min,x_max,x_mean,x_sd

list(map(summary_stat,[data[['lifeExp']],data[['pop']],data[['gdpPercap']]]))

# 2. 다음 조건을 만족하는 임의의 데이터프레임을 하나 만든다.
# (1) 열의 갯수와 행의 갯수가 각각 5개 이상이어야 한다.  
# (2) 열에는 정수, 문자열, 실수 자료형 데이터가 각각 1개 이상씩 포함되어 있어야 한다.  
# -> NaN, 컬럼/행 index지정 등 연습  


data={'정수':[1,2,3,4,5],
      '문자':['A','B','C','D','E'],
      '실수':[3.3,0.9,3.25,3.4,1.1],
      '정수2':[1,2,3,4,5],
      '문자2':['a','b','c','d','e']}
mydata=pd.DataFrame(data,index=['가','나','다','라','마'])
mydata.dtypes
mydata.T

mydata.index=range(len(mydata))

mydata.columns.name='타입'
mydata.index.name='번호'
mydata.sample(5)

data={'정수':[1,2,3,4,5],
      '문자':['A','B','C','D','E'],
      '실수':[3.3,0.9,3.25,3.4,1.1],
      '정수2':[1,2,3,4,5],
      '문자2':['a','b','c','d','e']}
mydata=pd.DataFrame(data,columns=['정수','문자','실수','라','마'])

mydata

mydata.라.isnull()

# 3. 다음 데이터프레임에서 지정하는 데이터를 뽑아내거나 처리하라.

# data = {
#     "국어": [80, 90, 70, 30],
#     "영어": [90, 70, 60, 40],
#     "수학": [90, 60, 80, 70],
# }
# columns = ["국어", "영어", "수학"]
# index = ["춘향", "몽룡", "향단", "방자"]
# df = pd.DataFrame(data, index=index, columns=columns)
# (1) 모든 학생의 수학 점수를 시리즈로 나타낸다.
# (2) 모든 학생의 국어와 영어 점수를 데이터 프레임으로 나타낸다.
# (3) 모든 학생의 각 과목 평균 점수를 새로운 열로 추가한다.
# (4) 방자의 영어 점수를 80점으로 수정하고 평균 점수도 다시 계산한다.
# (5) 춘향의 점수를 데이터프레임으로 나타낸다.
# (6) 향단의 점수를 시리즈로 나타낸다.

test=pd.DataFrame(data = {
    "국어": [80, 90, 70, 30],
    "영어": [90, 70, 60, 40],
    "수학": [90, 60, 80, 70],
},
columns = ["국어", "영어", "수학"],
index = ["춘향", "몽룡", "향단", "방자"])

type(test.수학)
test.수학

test[['국어','영어']]

test['평균']=(test.국어+test.영어+test.수학)/3
test['평균']

test.loc['빙자','영어']=80
test['평균']=(test.국어+test.영어+test.수학)/3
test['평균']

test.loc[['춘향']]
type(test.loc[['춘향']])

type(test.loc['향단',:])
test.loc['향단',:]

# 4. 
# 제공된 파일중 scientists.csv 파일을 읽고, 다음 작업을 진행하시오
# -나이 최대값
# -나이 평균
# -나이 평균보다 큰 나이 값을 모두 출력
# -나이에 2를 곱한 값으로 'ages2' 열 추가

sci=pd.read_csv("C:/Users/19178/TIL/jupyter/pandas_data/scientists.csv")

sci.shape

sci.head(5)

sci.Age.mean()

sci.Age[sci.Age >sci.Age.mean()]

sci['ages2']=sci.Age*2

sci.head(3)